sergz72/ARM/mspm0g350x/ti/driverlib/dl_unicommuart.h
/** @addtogroup DL_UART_MAIN_MACROS
 *  Macros to retain compatibility with standalone dl_uart_main APIs
 *  @{
 */
/*! Redirects to @ref DL_UART_INTERRUPT_DMA_DONE_TX */
#define DL_UART_MAIN_INTERRUPT_DMA_DONE_TX              DL_UART_INTERRUPT_DMA_DONE_TX
/*! Redirects to @ref DL_UART_INTERRUPT_DMA_DONE_RX */
#define DL_UART_MAIN_INTERRUPT_DMA_DONE_RX              DL_UART_INTERRUPT_DMA_DONE_RX
/*! Redirects to @ref DL_UART_INTERRUPT_CTS_DONE */
#define DL_UART_MAIN_INTERRUPT_CTS_DONE                 DL_UART_INTERRUPT_CTS_DONE
/*! Redirects to @ref DL_UART_INTERRUPT_EOT_DONE */
#define DL_UART_MAIN_INTERRUPT_EOT_DONE                 DL_UART_INTERRUPT_EOT_DONE
/*! Redirects to @ref DL_UART_INTERRUPT_TX */
#define DL_UART_MAIN_INTERRUPT_TX                       DL_UART_INTERRUPT_TX
/*! Redirects to @ref DL_UART_INTERRUPT_RX */
#define DL_UART_MAIN_INTERRUPT_RX                       DL_UART_INTERRUPT_RX
/*! Redirects to @ref DL_UART_INTERRUPT_RXD_POS_EDGE */
#define DL_UART_MAIN_INTERRUPT_RXD_POS_EDGE             DL_UART_INTERRUPT_RXD_POS_EDGE
/*! Redirects to @ref DL_UART_INTERRUPT_RXD_NEG_EDGE */
#define DL_UART_MAIN_INTERRUPT_RXD_NEG_EDGE             DL_UART_INTERRUPT_RXD_NEG_EDGE
/*! Redirects to @ref DL_UART_INTERRUPT_OVERRUN_ERROR */
#define DL_UART_MAIN_INTERRUPT_OVERRUN_ERROR            DL_UART_INTERRUPT_OVERRUN_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_BREAK_ERROR */
#define DL_UART_MAIN_INTERRUPT_BREAK_ERROR              DL_UART_INTERRUPT_BREAK_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_PARITY_ERROR */
#define DL_UART_MAIN_INTERRUPT_PARITY_ERROR             DL_UART_INTERRUPT_PARITY_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_FRAMING_ERROR */
#define DL_UART_MAIN_INTERRUPT_FRAMING_ERROR            DL_UART_INTERRUPT_FRAMING_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_RX_TIMEOUT_ERROR */
#define DL_UART_MAIN_INTERRUPT_RX_TIMEOUT_ERROR         DL_UART_INTERRUPT_RX_TIMEOUT_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_NOISE_ERROR */
#define DL_UART_MAIN_INTERRUPT_NOISE_ERROR              DL_UART_INTERRUPT_NOISE_ERROR
/*! Redirects to @ref DL_UART_IIDX_DMA_DONE_TX */
#define DL_UART_MAIN_IIDX_DMA_DONE_TX                   DL_UART_IIDX_DMA_DONE_TX
/*! Redirects to @ref DL_UART_IIDX_DMA_DONE_RX */
#define DL_UART_MAIN_IIDX_DMA_DONE_RX                   DL_UART_IIDX_DMA_DONE_RX
/*! Redirects to @ref DL_UART_IIDX_CTS_DONE */
#define DL_UART_MAIN_IIDX_CTS_DONE                      DL_UART_IIDX_CTS_DONE
/*! Redirects to @ref DL_UART_IIDX_EOT_DONE */
#define DL_UART_MAIN_IIDX_EOT_DONE                      DL_UART_IIDX_EOT_DONE
/*! Redirects to @ref DL_UART_IIDX_TX */
#define DL_UART_MAIN_IIDX_TX                            DL_UART_IIDX_TX
/*! Redirects to @ref DL_UART_IIDX_RX */
#define DL_UART_MAIN_IIDX_RX                            DL_UART_IIDX_RX
/*! Redirects to @ref DL_UART_IIDX_RXD_POS_EDGE */
#define DL_UART_MAIN_IIDX_RXD_POS_EDGE                  DL_UART_IIDX_RXD_POS_EDGE
/*! Redirects to @ref DL_UART_IIDX_RXD_NEG_EDGE */
#define DL_UART_MAIN_IIDX_RXD_NEG_EDGE                  DL_UART_IIDX_RXD_NEG_EDGE
/*! Redirects to @ref DL_UART_IIDX_OVERRUN_ERROR */
#define DL_UART_MAIN_IIDX_OVERRUN_ERROR                 DL_UART_IIDX_OVERRUN_ERROR
/*! Redirects to @ref DL_UART_IIDX_BREAK_ERROR */
#define DL_UART_MAIN_IIDX_BREAK_ERROR                   DL_UART_IIDX_BREAK_ERROR
/*! Redirects to @ref DL_UART_IIDX_PARITY_ERROR */
#define DL_UART_MAIN_IIDX_PARITY_ERROR                  DL_UART_IIDX_PARITY_ERROR
/*! Redirects to @ref DL_UART_IIDX_FRAMING_ERROR */
#define DL_UART_MAIN_IIDX_FRAMING_ERROR                 DL_UART_IIDX_FRAMING_ERROR
/*! Redirects to @ref DL_UART_IIDX_RX_TIMEOUT_ERROR */
#define DL_UART_MAIN_IIDX_RX_TIMEOUT_ERROR              DL_UART_IIDX_RX_TIMEOUT_ERROR
/*! Redirects to @ref DL_UART_IIDX_NOISE_ERROR */
#define DL_UART_MAIN_IIDX_NOISE_ERROR                   DL_UART_IIDX_NOISE_ERROR
/*! Redirects to @ref DL_UART_IIDX_NO_INTERRUPT */
#define DL_UART_MAIN_IIDX_NO_INTERRUPT                  DL_UART_IIDX_NO_INTERRUPT
/*! Redirects to @ref DL_UART_DMA_INTERRUPT_RX */
#define DL_UART_MAIN_DMA_INTERRUPT_RX                   DL_UART_DMA_INTERRUPT_RX
/*! Redirects to @ref DL_UART_DMA_INTERRUPT_RX_TIMEOUT */
#define DL_UART_MAIN_DMA_INTERRUPT_RX_TIMEOUT           DL_UART_DMA_INTERRUPT_RX_TIMEOUT
/*! Redirects to @ref DL_UART_DMA_INTERRUPT_TX */
#define DL_UART_MAIN_DMA_INTERRUPT_TX                   DL_UART_DMA_INTERRUPT_TX
/*! Redirects to @ref DL_UART_ERROR_BREAK */
#define DL_UART_MAIN_ERROR_BREAK                        DL_UART_ERROR_BREAK
/*! Redirects to @ref DL_UART_ERROR_PARITY */
#define DL_UART_MAIN_ERROR_PARITY                       DL_UART_ERROR_PARITY
/*! Redirects to @ref DL_UART_ERROR_FRAMING */
#define DL_UART_MAIN_ERROR_FRAMING                      DL_UART_ERROR_FRAMING
/*! Redirects to @ref DL_UART_OVERSAMPLING_RATE_16X */
#define DL_UART_MAIN_OVERSAMPLING_RATE_16X              DL_UART_OVERSAMPLING_RATE_16X
/*! Redirects to @ref DL_UART_OVERSAMPLING_RATE_8X */
#define DL_UART_MAIN_OVERSAMPLING_RATE_8X               DL_UART_OVERSAMPLING_RATE_8X
/*! Redirects to @ref DL_UART_OVERSAMPLING_RATE_3X */
#define DL_UART_MAIN_OVERSAMPLING_RATE_3X               DL_UART_OVERSAMPLING_RATE_3X
/*! Redirects to @ref DL_UART_PARITY_EVEN */
#define DL_UART_MAIN_PARITY_EVEN                        DL_UART_PARITY_EVEN
/*! Redirects to @ref DL_UART_PARITY_ODD */
#define DL_UART_MAIN_PARITY_ODD                         DL_UART_PARITY_ODD
/*! Redirects to @ref DL_UART_PARITY_STICK_ONE */
#define DL_UART_MAIN_PARITY_STICK_ONE                   DL_UART_PARITY_STICK_ONE
/*! Redirects to @ref DL_UART_PARITY_STICK_ZERO */
#define DL_UART_MAIN_PARITY_STICK_ZERO                  DL_UART_PARITY_STICK_ZERO
/*! Redirects to @ref DL_UART_PARITY_NONE */
#define DL_UART_MAIN_PARITY_NONE                        DL_UART_PARITY_NONE
/*! Redirects to @ref DL_UART_WORD_LENGTH_5_BITS */
#define DL_UART_MAIN_WORD_LENGTH_5_BITS                 DL_UART_WORD_LENGTH_5_BITS
/*! Redirects to @ref DL_UART_WORD_LENGTH_6_BITS */
#define DL_UART_MAIN_WORD_LENGTH_6_BITS                 DL_UART_WORD_LENGTH_6_BITS
/*! Redirects to @ref DL_UART_WORD_LENGTH_7_BITS */
#define DL_UART_MAIN_WORD_LENGTH_7_BITS                 DL_UART_WORD_LENGTH_7_BITS
/*! Redirects to @ref DL_UART_WORD_LENGTH_8_BITS */
#define DL_UART_MAIN_WORD_LENGTH_8_BITS                 DL_UART_WORD_LENGTH_8_BITS
/*! Redirects to @ref DL_UART_MODE_NORMAL */
#define DL_UART_MAIN_MODE_NORMAL                        DL_UART_MODE_NORMAL
/*! Redirects to @ref DL_UART_MODE_RS485 */
#define DL_UART_MAIN_MODE_RS485                         DL_UART_MODE_RS485
/*! Redirects to @ref DL_UART_MODE_IDLE_LINE */
#define DL_UART_MAIN_MODE_IDLE_LINE                     DL_UART_MODE_IDLE_LINE
/*! Redirects to @ref DL_UART_MODE_ADDR_9_BIT */
#define DL_UART_MAIN_MODE_ADDR_9_BIT                    DL_UART_MODE_ADDR_9_BIT
/*! Redirects to @ref DL_UART_DIRECTION_TX */
#define DL_UART_MAIN_DIRECTION_TX                       DL_UART_DIRECTION_TX
/*! Redirects to @ref DL_UART_DIRECTION_RX */
#define DL_UART_MAIN_DIRECTION_RX                       DL_UART_DIRECTION_RX
/*! Redirects to @ref DL_UART_DIRECTION_TX_RX */
#define DL_UART_MAIN_DIRECTION_TX_RX                    DL_UART_DIRECTION_TX_RX
/*! Redirects to @ref DL_UART_DIRECTION_NONE */
#define DL_UART_MAIN_DIRECTION_NONE                     DL_UART_DIRECTION_NONE
/*! Redirects to @ref DL_UART_CLOCK_BUSCLK */
#define DL_UART_MAIN_CLOCK_BUSCLK                       DL_UART_CLOCK_BUSCLK
/*! Redirects to @ref DL_UART_CLOCK_MFCLK */
#define DL_UART_MAIN_CLOCK_MFCLK                        DL_UART_CLOCK_MFCLK
/*! Redirects to @ref DL_UART_CLOCK_LFCLK */
#define DL_UART_MAIN_CLOCK_LFCLK                        DL_UART_CLOCK_LFCLK
/*! Redirects to @ref DL_UART_FLOW_CONTROL_RTS */
#define DL_UART_MAIN_FLOW_CONTROL_RTS                   DL_UART_FLOW_CONTROL_RTS
/*! Redirects to @ref DL_UART_FLOW_CONTROL_CTS */
#define DL_UART_MAIN_FLOW_CONTROL_CTS                   DL_UART_FLOW_CONTROL_CTS
/*! Redirects to @ref DL_UART_FLOW_CONTROL_RTS_CTS */
#define DL_UART_MAIN_FLOW_CONTROL_RTS_CTS               DL_UART_FLOW_CONTROL_RTS_CTS
/*! Redirects to @ref DL_UART_FLOW_CONTROL_NONE */
#define DL_UART_MAIN_FLOW_CONTROL_NONE                  DL_UART_FLOW_CONTROL_NONE
/*! Redirects to @ref DL_UART_RTS_ASSERT */
#define DL_UART_MAIN_RTS_ASSERT                         DL_UART_RTS_ASSERT
/*! Redirects to @ref DL_UART_RTS_DEASSERT */
#define DL_UART_MAIN_RTS_DEASSERT                       DL_UART_RTS_DEASSERT
/*! Redirects to @ref DL_UART_STOP_BITS_ONE */
#define DL_UART_MAIN_STOP_BITS_ONE                      DL_UART_STOP_BITS_ONE
/*! Redirects to @ref DL_UART_STOP_BITS_TWO */
#define DL_UART_MAIN_STOP_BITS_TWO                      DL_UART_STOP_BITS_TWO
/*! Redirects to @ref DL_UART_TXD_OUT_LOW */
#define DL_UART_MAIN_TXD_OUT_LOW                        DL_UART_TXD_OUT_LOW
/*! Redirects to @ref DL_UART_TXD_OUT_HIGH */
#define DL_UART_MAIN_TXD_OUT_HIGH                       DL_UART_TXD_OUT_HIGH
/*! Redirects to @ref DL_UART_TX_FIFO_LEVEL_3_4_EMPTY */
#define DL_UART_MAIN_TX_FIFO_LEVEL_3_4_EMPTY            DL_UART_TX_FIFO_LEVEL_3_4_EMPTY
/*! Redirects to @ref DL_UART_TX_FIFO_LEVEL_1_4_EMPTY */
#define DL_UART_MAIN_TX_FIFO_LEVEL_1_4_EMPTY            DL_UART_TX_FIFO_LEVEL_1_4_EMPTY
/*! Redirects to @ref DL_UART_TX_FIFO_LEVEL_EMPTY */
#define DL_UART_MAIN_TX_FIFO_LEVEL_EMPTY                DL_UART_TX_FIFO_LEVEL_EMPTY
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_FULL */
#define DL_UART_MAIN_RX_FIFO_LEVEL_FULL                 DL_UART_RX_FIFO_LEVEL_FULL
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_3_4_FULL */
#define DL_UART_MAIN_RX_FIFO_LEVEL_3_4_FULL             DL_UART_RX_FIFO_LEVEL_3_4_FULL
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_1_2_FULL */
#define DL_UART_MAIN_RX_FIFO_LEVEL_1_2_FULL             DL_UART_RX_FIFO_LEVEL_1_2_FULL
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_1_4_FULL */
#define DL_UART_MAIN_RX_FIFO_LEVEL_1_4_FULL             DL_UART_RX_FIFO_LEVEL_1_4_FULL
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_1 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_1               DL_UART_CLOCK_DIVIDE_RATIO_1
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_2 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_2               DL_UART_CLOCK_DIVIDE_RATIO_2
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_3 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_3               DL_UART_CLOCK_DIVIDE_RATIO_3
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_4 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_4               DL_UART_CLOCK_DIVIDE_RATIO_4
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_5 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_5               DL_UART_CLOCK_DIVIDE_RATIO_5
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_6 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_6               DL_UART_CLOCK_DIVIDE_RATIO_6
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_7 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_7               DL_UART_CLOCK_DIVIDE_RATIO_7
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_8 */
#define DL_UART_MAIN_CLOCK_DIVIDE_RATIO_8               DL_UART_CLOCK_DIVIDE_RATIO_8
/*! Redirects to @ref DL_UART_Config */
#define DL_UART_Main_Config                             DL_UART_Config
/*! Redirects to @ref DL_UART_ClockConfig */
#define DL_UART_Main_ClockConfig                        DL_UART_ClockConfig
/*! Redirects to @ref DL_UART_init */
#define DL_UART_Main_init                               DL_UART_init
/*! Redirects to @ref DL_UART_enablePower */
#define DL_UART_Main_enablePower                        DL_UART_enablePower
/*! Redirects to @ref DL_UART_disablePower */
#define DL_UART_Main_disablePower                       DL_UART_disablePower
/*! Redirects to @ref DL_UART_isPowerEnabled */
#define DL_UART_Main_isPowerEnabled                     DL_UART_isPowerEnabled
/*! Redirects to @ref DL_UART_reset */
#define DL_UART_Main_reset                              DL_UART_reset
/*! Redirects to @ref DL_UART_enable */
#define DL_UART_Main_enable                             DL_UART_enable
/*! Redirects to @ref DL_UART_isEnabled */
#define DL_UART_Main_isEnabled                          DL_UART_isEnabled
/*! Redirects to @ref DL_UART_disable */
#define DL_UART_Main_disable                            DL_UART_disable
/*! Redirects to @ref DL_UART_setClockConfig */
#define DL_UART_Main_setClockConfig                     DL_UART_setClockConfig
/*! Redirects to @ref DL_UART_getClockConfig */
#define DL_UART_Main_getClockConfig                     DL_UART_getClockConfig
/*! Redirects to @ref DL_UART_configBaudRate */
#define DL_UART_Main_configBaudRate                     DL_UART_configBaudRate
/*! Redirects to @ref DL_UART_setOversampling */
#define DL_UART_Main_setOversampling                    DL_UART_setOversampling
/*! Redirects to @ref DL_UART_getOversampling */
#define DL_UART_Main_getOversampling                    DL_UART_getOversampling
/*! Redirects to @ref DL_UART_enableLoopbackMode */
#define DL_UART_Main_enableLoopbackMode                 DL_UART_enableLoopbackMode
/*! Redirects to @ref DL_UART_isLoopbackModeEnabled */
#define DL_UART_Main_isLoopbackModeEnabled              DL_UART_isLoopbackModeEnabled
/*! Redirects to @ref DL_UART_disableLoopbackMode */
#define DL_UART_Main_disableLoopbackMode                DL_UART_disableLoopbackMode
/*! Redirects to @ref DL_UART_setDirection */
#define DL_UART_Main_setDirection                       DL_UART_setDirection
/*! Redirects to @ref DL_UART_getDirection */
#define DL_UART_Main_getDirection                       DL_UART_getDirection
/*! Redirects to @ref DL_UART_enableMajorityVoting */
#define DL_UART_Main_enableMajorityVoting               DL_UART_enableMajorityVoting
/*! Redirects to @ref DL_UART_isMajorityVotingEnabled */
#define DL_UART_Main_isMajorityVotingEnabled            DL_UART_isMajorityVotingEnabled
/*! Redirects to @ref DL_UART_disableMajorityVoting */
#define DL_UART_Main_disableMajorityVoting              DL_UART_disableMajorityVoting
/*! Redirects to @ref DL_UART_enableMSBFirst */
#define DL_UART_Main_enableMSBFirst                     DL_UART_enableMSBFirst
/*! Redirects to @ref DL_UART_isMSBFirstEnabled */
#define DL_UART_Main_isMSBFirstEnabled                  DL_UART_isMSBFirstEnabled
/*! Redirects to @ref DL_UART_disableMSBFirst */
#define DL_UART_Main_disableMSBFirst                    DL_UART_disableMSBFirst
/*! Redirects to @ref DL_UART_enableTransmitPinManualControl */
#define DL_UART_Main_enableTransmitPinManualControl     DL_UART_enableTransmitPinManualControl
/*! Redirects to @ref DL_UART_isTransmitPinManualControlEnabled */
#define DL_UART_Main_isTransmitPinManualControlEnabl    DL_UART_isTransmitPinManualControlEnabled
/*! Redirects to @ref DL_UART_disableTransmitPinManualControl */
#define DL_UART_Main_disableTransmitPinManualControl    DL_UART_disableTransmitPinManualControl
/*! Redirects to @ref DL_UART_setTransmitPinManualOutput */
#define DL_UART_Main_setTransmitPinManualOutput         DL_UART_setTransmitPinManualOutput
/*! Redirects to @ref DL_UART_getTransmitPinManualOutput */
#define DL_UART_Main_getTransmitPinManualOutput         DL_UART_getTransmitPinManualOutput
/*! Redirects to @ref DL_UART_setCommunicationMode */
#define DL_UART_Main_setCommunicationMode               DL_UART_setCommunicationMode
/*! Redirects to @ref DL_UART_getCommunicationMode */
#define DL_UART_Main_getCommunicationMode               DL_UART_getCommunicationMode
/*! Redirects to @ref DL_UART_setFlowControl */
#define DL_UART_Main_setFlowControl                     DL_UART_setFlowControl
/*! Redirects to @ref DL_UART_getFlowControl */
#define DL_UART_Main_getFlowControl                     DL_UART_getFlowControl
/*! Redirects to @ref DL_UART_setRTSOutput */
#define DL_UART_Main_setRTSOutput                       DL_UART_setRTSOutput
/*! Redirects to @ref DL_UART_enableFIFOs */
#define DL_UART_Main_enableFIFOs                        DL_UART_enableFIFOs
/*! Redirects to @ref DL_UART_disableFIFOs */
#define DL_UART_Main_disableFIFOs                       DL_UART_disableFIFOs
/*! Redirects to @ref DL_UART_isFIFOsEnabled */
#define DL_UART_Main_isFIFOsEnabled                     DL_UART_isFIFOsEnabled
/*! Redirects to @ref DL_UART_isParityEnabled */
#define DL_UART_Main_isParityEnabled                    DL_UART_isParityEnabled
/*! Redirects to @ref DL_UART_setParityMode */
#define DL_UART_Main_setParityMode                      DL_UART_setParityMode
/*! Redirects to @ref DL_UART_getParityMode */
#define DL_UART_Main_getParityMode                      DL_UART_getParityMode
/*! Redirects to @ref DL_UART_setStopBits */
#define DL_UART_Main_setStopBits                        DL_UART_setStopBits
/*! Redirects to @ref DL_UART_getStopBits */
#define DL_UART_Main_getStopBits                        DL_UART_getStopBits
/*! Redirects to @ref DL_UART_setWordLength */
#define DL_UART_Main_setWordLength                      DL_UART_setWordLength
/*! Redirects to @ref DL_UART_getWordLength */
#define DL_UART_Main_getWordLength                      DL_UART_getWordLength
/*! Redirects to @ref DL_UART_enableSendIdlePattern */
#define DL_UART_Main_enableSendIdlePattern              DL_UART_enableSendIdlePattern
/*! Redirects to @ref DL_UART_disableSendIdlePattern */
#define DL_UART_Main_disableSendIdlePattern             DL_UART_disableSendIdlePattern
/*! Redirects to @ref DL_UART_isSendIdlePatternEnabled */
#define DL_UART_Main_isSendIdlePatternEnabled           DL_UART_isSendIdlePatternEnabled
/*! Redirects to @ref DL_UART_setExternalDriverSetup */
#define DL_UART_Main_setExternalDriverSetup             DL_UART_setExternalDriverSetup
/*! Redirects to @ref DL_UART_getExternalDriverSetup */
#define DL_UART_Main_getExternalDriverSetup             DL_UART_getExternalDriverSetup
/*! Redirects to @ref DL_UART_setExternalDriverHold */
#define DL_UART_Main_setExternalDriverHold              DL_UART_setExternalDriverHold
/*! Redirects to @ref DL_UART_getExternalDriverHold */
#define DL_UART_Main_getExternalDriverHold              DL_UART_getExternalDriverHold
/*! Redirects to @ref DL_UART_isBusy */
#define DL_UART_Main_isBusy                             DL_UART_isBusy
/*! Redirects to @ref DL_UART_isRXFIFOEmpty */
#define DL_UART_Main_isRXFIFOEmpty                      DL_UART_isRXFIFOEmpty
/*! Redirects to @ref DL_UART_isRXFIFOFull */
#define DL_UART_Main_isRXFIFOFull                       DL_UART_isRXFIFOFull
/*! Redirects to @ref DL_UART_isTXFIFOEmpty */
#define DL_UART_Main_isTXFIFOEmpty                      DL_UART_isTXFIFOEmpty
/*! Redirects to @ref DL_UART_isTXFIFOFull */
#define DL_UART_Main_isTXFIFOFull                       DL_UART_isTXFIFOFull
/*! Redirects to @ref DL_UART_isClearToSend */
#define DL_UART_Main_isClearToSend                      DL_UART_isClearToSend
/*! Redirects to @ref DL_UART_isIdleModeDetected */
#define DL_UART_Main_isIdleModeDetected                 DL_UART_isIdleModeDetected
/*! Redirects to @ref DL_UART_setTXFIFOThreshold */
#define DL_UART_Main_setTXFIFOThreshold                 DL_UART_setTXFIFOThreshold
/*! Redirects to @ref DL_UART_getTXFIFOThreshold */
#define DL_UART_Main_getTXFIFOThreshold                 DL_UART_getTXFIFOThreshold
/*! Redirects to @ref DL_UART_setRXFIFOThreshold */
#define DL_UART_Main_setRXFIFOThreshold                 DL_UART_setRXFIFOThreshold
/*! Redirects to @ref DL_UART_getRXFIFOThreshold */
#define DL_UART_Main_getRXFIFOThreshold                 DL_UART_getRXFIFOThreshold
/*! Redirects to @ref DL_UART_setRXInterruptTimeout */
#define DL_UART_Main_setRXInterruptTimeout              DL_UART_setRXInterruptTimeout
/*! Redirects to @ref DL_UART_getRXInterruptTimeout */
#define DL_UART_Main_getRXInterruptTimeout              DL_UART_getRXInterruptTimeout
/*! Redirects to @ref DL_UART_getIntegerBaudRateDivisor */
#define DL_UART_Main_getIntegerBaudRateDivisor          DL_UART_getIntegerBaudRateDivisor
/*! Redirects to @ref DL_UART_getFractionalBaudRateDivisor */
#define DL_UART_Main_getFractionalBaudRateDivisor       DL_UART_getFractionalBaudRateDivisor
/*! Redirects to @ref DL_UART_setBaudRateDivisor */
#define DL_UART_Main_setBaudRateDivisor                 DL_UART_setBaudRateDivisor
/*! Redirects to @ref DL_UART_transmitData */
#define DL_UART_Main_transmitData                       DL_UART_transmitData
/*! Redirects to @ref DL_UART_receiveData */
#define DL_UART_Main_receiveData                        DL_UART_receiveData
/*! Redirects to @ref DL_UART_getErrorStatus */
#define DL_UART_Main_getErrorStatus                     DL_UART_getErrorStatus
/*! Redirects to @ref DL_UART_enableInterrupt */
#define DL_UART_Main_enableInterrupt                    DL_UART_enableInterrupt
/*! Redirects to @ref DL_UART_disableInterrupt */
#define DL_UART_Main_disableInterrupt                   DL_UART_disableInterrupt
/*! Redirects to @ref DL_UART_getEnabledInterrupts */
#define DL_UART_Main_getEnabledInterrupts               DL_UART_getEnabledInterrupts
/*! Redirects to @ref DL_UART_getEnabledInterruptStatus */
#define DL_UART_Main_getEnabledInterruptStatus          DL_UART_getEnabledInterruptStatus
/*! Redirects to @ref DL_UART_getRawInterruptStatus */
#define DL_UART_Main_getRawInterruptStatus              DL_UART_getRawInterruptStatus
/*! Redirects to @ref DL_UART_getPendingInterrupt */
#define DL_UART_Main_getPendingInterrupt                DL_UART_getPendingInterrupt
/*! Redirects to @ref DL_UART_clearInterruptStatus */
#define DL_UART_Main_clearInterruptStatus               DL_UART_clearInterruptStatus
/*! Redirects to @ref DL_UART_changeConfig */
#define DL_UART_Main_changeConfig                       DL_UART_changeConfig
/*! Redirects to @ref DL_UART_transmitDataBlocking */
#define DL_UART_Main_transmitDataBlocking               DL_UART_transmitDataBlocking
/*! Redirects to @ref DL_UART_receiveDataBlocking */
#define DL_UART_Main_receiveDataBlocking                DL_UART_receiveDataBlocking
/*! Redirects to @ref DL_UART_transmitDataCheck */
#define DL_UART_Main_transmitDataCheck                  DL_UART_transmitDataCheck
/*! Redirects to @ref DL_UART_receiveDataCheck */
#define DL_UART_Main_receiveDataCheck                   DL_UART_receiveDataCheck
/*! Redirects to @ref DL_UART_drainRXFIFO */
#define DL_UART_Main_drainRXFIFO                        DL_UART_drainRXFIFO
/*! Redirects to @ref DL_UART_fillTXFIFO */
#define DL_UART_Main_fillTXFIFO                         DL_UART_fillTXFIFO
/*! Redirects to @ref DL_UART_enableDMAReceiveEvent */
#define DL_UART_Main_enableDMAReceiveEvent              DL_UART_enableDMAReceiveEvent
/*! Redirects to @ref DL_UART_enableDMATransmitEvent */
#define DL_UART_Main_enableDMATransmitEvent             DL_UART_enableDMATransmitEvent
/*! Redirects to @ref DL_UART_disableDMAReceiveEvent */
#define DL_UART_Main_disableDMAReceiveEvent             DL_UART_disableDMAReceiveEvent
/*! Redirects to @ref DL_UART_disableDMATransmitEvent */
#define DL_UART_Main_disableDMATransmitEvent            DL_UART_disableDMATransmitEvent
/*! Redirects to @ref DL_UART_getEnabledDMAReceiveEvent */
#define DL_UART_Main_getEnabledDMAReceiveEvent          DL_UART_getEnabledDMAReceiveEvent
/*! Redirects to @ref DL_UART_getEnabledDMATransmitEvent */
#define DL_UART_Main_getEnabledDMATransmitEvent         DL_UART_getEnabledDMATransmitEvent
/*! Redirects to @ref DL_UART_getEnabledDMAReceiveEventStatus */
#define DL_UART_Main_getEnabledDMAReceiveEventStatus    DL_UART_getEnabledDMAReceiveEventStatus
/*! Redirects to @ref DL_UART_getEnabledDMATransmitEventStatus */
#define DL_UART_Main_getEnabledDMATransmitEventStatu    DL_UART_getEnabledDMATransmitEventStatus
/*! Redirects to @ref DL_UART_getRawDMAReceiveEventStatus */
#define DL_UART_Main_getRawDMAReceiveEventStatus        DL_UART_getRawDMAReceiveEventStatus
/*! Redirects to @ref DL_UART_getRawDMATransmitEventStatus */
#define DL_UART_Main_getRawDMATransmitEventStatus       DL_UART_getRawDMATransmitEventStatus
/** @}*/

