sergz72/ARM/mspm0g350x/ti/driverlib/dl_unicommuart.h
/** @addtogroup DL_UART_INTERRUPT
 *  @{
 */
/*!
 * @brief DMA done on transmit interrupt
 */
#define DL_UART_INTERRUPT_DMA_DONE_TX   (UNICOMMUART_CPU_INT_IMASK_DMA_DONE_TX_SET)

/*!
 * @brief DMA done on receive interrupt
 */
#define DL_UART_INTERRUPT_DMA_DONE_RX   (UNICOMMUART_CPU_INT_IMASK_DMA_DONE_RX_SET)

/*!
 * @brief Clear to send interrupt
 */
#define DL_UART_INTERRUPT_CTS_DONE              (UNICOMMUART_CPU_INT_IMASK_CTS_SET)

/*!
 * @brief 9-bit mode address match interrupt
 */
#define DL_UART_INTERRUPT_ADDRESS_MATCH  (UNICOMMUART_CPU_INT_IMASK_ADDR_MATCH_SET)

/*!
 * @brief LINC0 match interrupt
 */
#define DL_UART_INTERRUPT_LINC0_MATCH         (UNICOMMUART_CPU_INT_IMASK_LINC0_SET)

/*!
 * @brief End of transmission interrupt
 */
#define DL_UART_INTERRUPT_EOT_DONE              (UNICOMMUART_CPU_INT_IMASK_EOT_SET)

/*!
 * @brief UART transmit interrupt
 */
#define DL_UART_INTERRUPT_TX                  (UNICOMMUART_CPU_INT_IMASK_TXINT_SET)

/*!
 * @brief UART receive interrupt
 */
#define DL_UART_INTERRUPT_RX                  (UNICOMMUART_CPU_INT_IMASK_RXINT_SET)

/*!
 * @brief LIN hardware counter overflow interrupt
 */
#define DL_UART_INTERRUPT_LIN_COUNTER_OVERFLOW                                \
                                             (UNICOMMUART_CPU_INT_IMASK_LINOVF_SET)

/*!
 * @brief LIN rising edge LINC1 interrupt
 */
#define DL_UART_INTERRUPT_LIN_RISING_EDGE                                     \
                                              (UNICOMMUART_CPU_INT_IMASK_LINC1_SET)

/*!
 * @brief LIN falling edge LINC0 interrupt
 */
#define DL_UART_INTERRUPT_LIN_FALLING_EDGE                                    \
                                              (UNICOMMUART_CPU_INT_IMASK_LINC0_SET)

/*!
 * @brief Positive Edge on UNICOMMUARTxRXD interrupt
 */
#define DL_UART_INTERRUPT_RXD_POS_EDGE         (UNICOMMUART_CPU_INT_IMASK_RXPE_SET)

/*!
 * @brief Negative Edge on UNICOMMUARTxRXD interrupt
 */
#define DL_UART_INTERRUPT_RXD_NEG_EDGE         (UNICOMMUART_CPU_INT_IMASK_RXNE_SET)

/*!
 * @brief Overrun error interrupt
 */
#define DL_UART_INTERRUPT_OVERRUN_ERROR      (UNICOMMUART_CPU_INT_IMASK_OVRERR_SET)

/*!
 * @brief Break error interrupt
 */
#define DL_UART_INTERRUPT_BREAK_ERROR        (UNICOMMUART_CPU_INT_IMASK_BRKERR_SET)

/*!
 * @brief Parity error interrupt
 */
#define DL_UART_INTERRUPT_PARITY_ERROR       (UNICOMMUART_CPU_INT_IMASK_PARERR_SET)

/*!
 * @brief Framing error interrupt
 */
#define DL_UART_INTERRUPT_FRAMING_ERROR      (UNICOMMUART_CPU_INT_IMASK_FRMERR_SET)

/*!
 * @brief Receive timeout interrupt
 */
#define DL_UART_INTERRUPT_RX_TIMEOUT_ERROR    (UNICOMMUART_CPU_INT_IMASK_RTOUT_SET)

/*!
 * @brief Noise error interrupt
 */
#define DL_UART_INTERRUPT_NOISE_ERROR          (UNICOMMUART_CPU_INT_IMASK_NERR_SET)

/*!
 * @brief Line timeout interrupt
 */
#define DL_UART_INTERRUPT_LINE_TIMEOUT         (UNICOMMUART_CPU_INT_IMASK_LTOUT_SET)

/** @}*/

/*! @enum DL_UART_IIDX */
typedef enum {
    /*! UART interrupt index for DMA done on transmit */
    DL_UART_IIDX_DMA_DONE_TX = UNICOMMUART_IIDX_STAT_DMA_DONE_TX,
    /*! UART interrupt index for DMA done on receive */
    DL_UART_IIDX_DMA_DONE_RX = UNICOMMUART_IIDX_STAT_DMA_DONE_RX,
    /*! Interrupt index for UART receive pre-emptive interrupt */
    DL_UART_IIDX_PREEMPT_INT_TX = UNICOMMUART_IIDX_STAT_DMA_PREIRQ_TX,
    /*! Interrupt index for UART receive pre-emptive interrupt */
    DL_UART_IIDX_PREEMPT_INT_RX = UNICOMMUART_IIDX_STAT_DMA_PREIRQ_RX,
    /*! UART interrupt index for clear to send */
    DL_UART_IIDX_CTS_DONE = UNICOMMUART_IIDX_STAT_CTS,
    /*! UART interrupt index for end of transmission */
    DL_UART_IIDX_EOT_DONE = UNICOMMUART_IIDX_STAT_EOT,
    /*! UART interrupt index for UART transmit */
    DL_UART_IIDX_TX = UNICOMMUART_IIDX_STAT_TXIFG,
    /*! UART interrupt index for UART receive */
    DL_UART_IIDX_RX = UNICOMMUART_IIDX_STAT_RXIFG,
    /*! UART interrupt index for LIN hardware counter overflow */
    DL_UART_IIDX_LIN_COUNTER_OVERFLOW = UNICOMMUART_IIDX_STAT_LINOVF,
    /*! UART interrupt index for LIN rising edge LINC1 */
    DL_UART_IIDX_LIN_RISING_EDGE = UNICOMMUART_IIDX_STAT_LINC1,
    /*! UART interrupt index for LINC0 match */
    DL_UART_IIDX_LINC0_MATCH = UNICOMMUART_IIDX_STAT_LINC0,
    /*! UART interrupt index for LIN falling edge LINC0 */
    DL_UART_IIDX_LIN_FALLING_EDGE = UNICOMMUART_IIDX_STAT_LINC0,
    /*! UART interrupt index for positive edge on UNICOMMUARTxRXD */
    DL_UART_IIDX_RXD_POS_EDGE = UNICOMMUART_IIDX_STAT_RXPE,
    /*! UART interrupt index for negative edge on UNICOMMUARTxRXD */
    DL_UART_IIDX_RXD_NEG_EDGE = UNICOMMUART_IIDX_STAT_RXNE,
    /*! UART interrupt index for overrun error */
    DL_UART_IIDX_OVERRUN_ERROR = UNICOMMUART_IIDX_STAT_OEFG,
    /*! UART interrupt index for break error */
    DL_UART_IIDX_BREAK_ERROR = UNICOMMUART_IIDX_STAT_BEFG,
    /*! UART interrupt index for parity error */
    DL_UART_IIDX_PARITY_ERROR = UNICOMMUART_IIDX_STAT_PEFG,
    /*! UART interrupt index for framing error */
    DL_UART_IIDX_FRAMING_ERROR = UNICOMMUART_IIDX_STAT_FEFG,
    /*! UART interrupt index for receive timeout */
    DL_UART_IIDX_RX_TIMEOUT_ERROR = UNICOMMUART_IIDX_STAT_RTFG,
    /*! UART interrupt index for noise error */
    DL_UART_IIDX_NOISE_ERROR = UNICOMMUART_IIDX_STAT_NERR_EVT,
    /*! UART interrupt index for no interrupt */
    DL_UART_IIDX_NO_INTERRUPT = UNICOMMUART_IIDX_STAT_NO_INTR,
    /*! UART interrupt index for 9-bit mode address match */
    DL_UART_IIDX_ADDRESS_MATCH = UNICOMMUART_IIDX_STAT_ADDR_MATCH,
    /*! UART interrupt index for line time-out */
    DL_UART_IIDX_LINE_TIMEOUT = UNICOMMUART_IIDX_STAT_LTFG
} DL_UART_IIDX;

/** @addtogroup DL_UART_DMA_INTERRUPT_RX
 *  @{
 */
/*!
 * @brief UART interrupt for enabling UART receive as DMA trigger
 */
#define DL_UART_DMA_INTERRUPT_RX              (UNICOMMUART_DMA_TRIG_RX_IMASK_RXINT_SET)

/*!
 * @brief UART interrupt for enabling UART receive timeout as DMA trigger
 */
#define DL_UART_DMA_INTERRUPT_RX_TIMEOUT      (UNICOMMUART_DMA_TRIG_RX_IMASK_RTOUT_SET)

/** @}*/

/*!
 * @brief UART interrupt for enabling UART transmit as DMA trigger
 */
#define DL_UART_DMA_INTERRUPT_TX              (UNICOMMUART_DMA_TRIG_TX_IMASK_TXINT_SET)

